四川社保/湖南动态库 - (自有)- 娄底/DEBUG/Reader.log


2015-12-02 14:22:25 发送:
(:1):
POST /sell_dan/test/testdemopost HTTP/1.1
Host: 127.0.0.1
Connection: keep-alive
Content-Length: 497
Content-Type: text/html;varchar2set=UTF-8

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><in:system xmlns:in="http://yinhai.com"><userName>HD001</userName><passWord>1234</passWord><jylsh>0</jylsh><jyyzm>0</jyyzm><jybh>MessageForward</jybh><fwlsh/><nbffyzm/><fwdysxh/></in:system></soap:Header><soap:Body><ns2:getJylsh xmlns:ns2="http://webservice.common.yinhai.com/"><inputxml>
<?xml version="1.0" encoding="UTF-8" standalone="yes"?><input></input></inputxml></ns2:getJylsh></soap:Body></soap:Envelope>

2015-12-02 14:22:25 接收:
(:1):
HTTP/1.1 200 OK
Server: Apache-Coyote/1.1
Content-Type: text/html;charset=UTF-8
Content-Length: 495
Date: Wed, 02 Dec 2015 06:22:25 GMT

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:getJylshResponse xmlns:ns2="http://webservice.common.yinhai.com/"><return><?xml version="1.0" encoding="UTF-8" standalone="yes"?><output><jylsh>151104427277614</jylsh><jyyzm>2345</jyyzm></output></return><code>1</code><message>haha</message><outmsg>41000000000000000010ba7cb5d03e93d00ea15d623b7b3edf48000000000000000000000000000000000000000000000000</outmsg></ns2:getJylshResponse></soap:Body></soap:Envelope>

2015-12-02 14:22:25 发送:
(:1):
POST /sell_dan/test/testdemopost HTTP/1.1
Host: 127.0.0.1
Connection: keep-alive
Content-Length: 674
Content-Type: text/html;varchar2set=UTF-8

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><in:system xmlns:in="http://yinhai.com"><userName>HD001</userName><passWord>1234</passWord><jylsh>151104427277614</jylsh><jyyzm>2345</jyyzm><jybh>MessageForward</jybh><fwlsh/><nbffyzm/><fwdysxh/></in:system></soap:Header><soap:Body><ns2:getJylsh xmlns:ns2="http://webservice.common.yinhai.com/"><inputxml><?xml version="1.0" encoding="UTF-8" standalone="yes"?><input><inputmsg>B0A50000000000000000010090023432303130307378868442010000013500A273F18414E54044080102030405060708</inputmsg><atr>3B6D00000081544C928684420100000135</atr></input></inputxml></ns2:getJylsh></soap:Body></soap:Envelope>

2015-12-02 14:22:25 接收:
(:1):
HTTP/1.1 200 OK
Server: Apache-Coyote/1.1
Content-Type: text/html;charset=UTF-8
Content-Length: 495
Date: Wed, 02 Dec 2015 06:22:25 GMT

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:getJylshResponse xmlns:ns2="http://webservice.common.yinhai.com/"><return><?xml version="1.0" encoding="UTF-8" standalone="yes"?><output><jylsh>151104427277614</jylsh><jyyzm>2345</jyyzm></output></return><code>1</code><message>haha</message><outmsg>41000000000000000010ba7cb5d03e93d00ea15d623b7b3edf48000000000000000000000000000000000000000000000000</outmsg></ns2:getJylshResponse></soap:Body></soap:Envelope>

2015-12-02 14:22:25 发送:
(:1):
POST /sell_dan/test/testdemopost HTTP/1.1
Host: 127.0.0.1
Connection: keep-alive
Content-Length: 497
Content-Type: text/html;varchar2set=UTF-8

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><in:system xmlns:in="http://yinhai.com"><userName>HD001</userName><passWord>1234</passWord><jylsh>0</jylsh><jyyzm>0</jyyzm><jybh>MessageForward</jybh><fwlsh/><nbffyzm/><fwdysxh/></in:system></soap:Header><soap:Body><ns2:getJylsh xmlns:ns2="http://webservice.common.yinhai.com/"><inputxml>
<?xml version="1.0" encoding="UTF-8" standalone="yes"?><input></input></inputxml></ns2:getJylsh></soap:Body></soap:Envelope>

2015-12-02 14:22:25 接收:
(:1):
HTTP/1.1 200 OK
Server: Apache-Coyote/1.1
Content-Type: text/html;charset=UTF-8
Content-Length: 495
Date: Wed, 02 Dec 2015 06:22:25 GMT

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:getJylshResponse xmlns:ns2="http://webservice.common.yinhai.com/"><return><?xml version="1.0" encoding="UTF-8" standalone="yes"?><output><jylsh>151104427277614</jylsh><jyyzm>2345</jyyzm></output></return><code>1</code><message>haha</message><outmsg>41000000000000000010ba7cb5d03e93d00ea15d623b7b3edf48000000000000000000000000000000000000000000000000</outmsg></ns2:getJylshResponse></soap:Body></soap:Envelope>

2015-12-02 14:22:25 发送:
(:1):
POST /sell_dan/test/testdemopost HTTP/1.1
Host: 127.0.0.1
Connection: keep-alive
Content-Length: 674
Content-Type: text/html;varchar2set=UTF-8

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><in:system xmlns:in="http://yinhai.com"><userName>HD001</userName><passWord>1234</passWord><jylsh>151104427277614</jylsh><jyyzm>2345</jyyzm><jybh>MessageForward</jybh><fwlsh/><nbffyzm/><fwdysxh/></in:system></soap:Header><soap:Body><ns2:getJylsh xmlns:ns2="http://webservice.common.yinhai.com/"><inputxml><?xml version="1.0" encoding="UTF-8" standalone="yes"?><input><inputmsg>B0A60000000000000000010173023432303130307378868442010000013500D35A1BBD61EFDEFD080312345680000000</inputmsg><atr>3B6D00000081544C928684420100000135</atr></input></inputxml></ns2:getJylsh></soap:Body></soap:Envelope>

2015-12-02 14:22:25 接收:
(:1):
HTTP/1.1 200 OK
Server: Apache-Coyote/1.1
Content-Type: text/html;charset=UTF-8
Content-Length: 495
Date: Wed, 02 Dec 2015 06:22:25 GMT

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:getJylshResponse xmlns:ns2="http://webservice.common.yinhai.com/"><return><?xml version="1.0" encoding="UTF-8" standalone="yes"?><output><jylsh>151104427277614</jylsh><jyyzm>2345</jyyzm></output></return><code>1</code><message>haha</message><outmsg>41000000000000000010ba7cb5d03e93d00ea15d623b7b3edf48000000000000000000000000000000000000000000000000</outmsg></ns2:getJylshResponse></soap:Body></soap:Envelope>

2015-12-02 14:22:25 发送:
(:1):
POST /sell_dan/test/testdemopost HTTP/1.1
Host: 127.0.0.1
Connection: keep-alive
Content-Length: 497
Content-Type: text/html;varchar2set=UTF-8

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><in:system xmlns:in="http://yinhai.com"><userName>HD001</userName><passWord>1234</passWord><jylsh>0</jylsh><jyyzm>0</jyyzm><jybh>MessageForward</jybh><fwlsh/><nbffyzm/><fwdysxh/></in:system></soap:Header><soap:Body><ns2:getJylsh xmlns:ns2="http://webservice.common.yinhai.com/"><inputxml>
<?xml version="1.0" encoding="UTF-8" standalone="yes"?><input></input></inputxml></ns2:getJylsh></soap:Body></soap:Envelope>

2015-12-02 14:22:25 接收:
(:1):
HTTP/1.1 200 OK
Server: Apache-Coyote/1.1
Content-Type: text/html;charset=UTF-8
Content-Length: 495
Date: Wed, 02 Dec 2015 06:22:25 GMT

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:getJylshResponse xmlns:ns2="http://webservice.common.yinhai.com/"><return><?xml version="1.0" encoding="UTF-8" standalone="yes"?><output><jylsh>151104427277614</jylsh><jyyzm>2345</jyyzm></output></return><code>1</code><message>haha</message><outmsg>41000000000000000010ba7cb5d03e93d00ea15d623b7b3edf48000000000000000000000000000000000000000000000000</outmsg></ns2:getJylshResponse></soap:Body></soap:Envelope>

2015-12-02 14:22:25 发送:
(:1):
POST /sell_dan/test/testdemopost HTTP/1.1
Host: 127.0.0.1
Connection: keep-alive
Content-Length: 724
Content-Type: text/html;varchar2set=UTF-8

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><in:system xmlns:in="http://yinhai.com"><userName>HD001</userName><passWord>1234</passWord><jylsh>151104427277614</jylsh><jyyzm>2345</jyyzm><jybh>MessageForward</jybh><fwlsh/><nbffyzm/><fwdysxh/></in:system></soap:Header><soap:Body><ns2:getJylsh xmlns:ns2="http://webservice.common.yinhai.com/"><inputxml><?xml version="1.0" encoding="UTF-8" standalone="yes"?><input><inputmsg>B0800000000000000000000173023432303130307378868442010000013500D35A1BBD61EFDEFD00000000000000000010842400010Cba7cb5d03e93d00ea15d623b7b3edf48800000</inputmsg><atr>3B6D00000081544C928684420100000135</atr></input></inputxml></ns2:getJylsh></soap:Body></soap:Envelope>

2015-12-02 14:22:25 接收:
(:1):
HTTP/1.1 200 OK
Server: Apache-Coyote/1.1
Content-Type: text/html;charset=UTF-8
Content-Length: 495
Date: Wed, 02 Dec 2015 06:22:25 GMT

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ns2:getJylshResponse xmlns:ns2="http://webservice.common.yinhai.com/"><return><?xml version="1.0" encoding="UTF-8" standalone="yes"?><output><jylsh>151104427277614</jylsh><jyyzm>2345</jyyzm></output></return><code>1</code><message>haha</message><outmsg>41000000000000000010ba7cb5d03e93d00ea15d623b7b3edf48000000000000000000000000000000000000000000000000</outmsg></ns2:getJylshResponse></soap:Body></soap:Envelope>
